OpenNuvoton/M030GBSP/Library/Device/Nuvoton/M030G/Include/adc_reg.h
#define ADC_ADSR0_CMPF0_Pos             (1)                                         /*!< ADC_T::ADSR0: CMPF0 Position           */
#define ADC_ADSR0_CMPF0_Msk             (0x1ul << ADC_ADSR0_CMPF0_Pos)              /*!< ADC_T::ADSR0: CMPF0 Mask               */

#define ADC_ADSR0_CMPF1_Pos             (2)                                         /*!< ADC_T::ADSR0: CMPF1 Position           */
#define ADC_ADSR0_CMPF1_Msk             (0x1ul << ADC_ADSR0_CMPF1_Pos)              /*!< ADC_T::ADSR0: CMPF1 Mask               */

#define ADC_ADSR0_BUSY_Pos              (7)                                         /*!< ADC_T::ADSR0: BUSY Position            */
#define ADC_ADSR0_BUSY_Msk              (0x1ul << ADC_ADSR0_BUSY_Pos)               /*!< ADC_T::ADSR0: BUSY Mask                */

#define ADC_ADSR0_VALIDF_Pos            (8)                                         /*!< ADC_T::ADSR0: VALIDF Position          */
#define ADC_ADSR0_VALIDF_Msk            (0x1ul << ADC_ADSR0_VALIDF_Pos)             /*!< ADC_T::ADSR0: VALIDF Mask              */

#define ADC_ADSR0_OVERRUNF_Pos          (16)                                        /*!< ADC_T::ADSR0: OVERRUNF Position        */
#define ADC_ADSR0_OVERRUNF_Msk          (0x1ul << ADC_ADSR0_OVERRUNF_Pos)           /*!< ADC_T::ADSR0: OVERRUNF Mask            */

#define ADC_ADSR0_PWURDY_Pos            (24)                                        /*!< ADC_T::ADSR0: PWURDY Position          */
#define ADC_ADSR0_PWURDY_Msk            (0x1ul << ADC_ADSR0_PWURDY_Pos)             /*!< ADC_T::ADSR0: PWURDY Mask              */

#define ADC_ADSR0_CHANNEL_Pos           (27)                                        /*!< ADC_T::ADSR0: CHANNEL Position         */
#define ADC_ADSR0_CHANNEL_Msk           (0x1ful << ADC_ADSR0_CHANNEL_Pos)           /*!< ADC_T::ADSR0: CHANNEL Mask             */

#define ADC_ADSR1_VALID_Pos             (0)                                         /*!< ADC_T::ADSR1: VALID Position           */
#define ADC_ADSR1_VALID_Msk             (0xfffffffful << ADC_ADSR1_VALID_Pos)       /*!< ADC_T::ADSR1: VALID Mask               */

#define ADC_ADSR2_OVERRUN_Pos           (0)                                         /*!< ADC_T::ADSR2: OVERRUN Position         */
#define ADC_ADSR2_OVERRUN_Msk           (0xfffffffful << ADC_ADSR2_OVERRUN_Pos)     /*!< ADC_T::ADSR2: OVERRUN Mask             */

#define ADC_ESMPCTL_EXTSMPT_Pos         (0)                                         /*!< ADC_T::ESMPCTL: EXTSMPT Position       */
#define ADC_ESMPCTL_EXTSMPT_Msk         (0xfful << ADC_ESMPCTL_EXTSMPT_Pos)         /*!< ADC_T::ESMPCTL: EXTSMPT Mask           */

#define ADC_CFDCTL_PRECHEN_Pos          (0)                                         /*!< ADC_T::CFDCTL: PRECHEN Position        */
#define ADC_CFDCTL_PRECHEN_Msk          (0x1ul << ADC_CFDCTL_PRECHEN_Pos)           /*!< ADC_T::CFDCTL: PRECHEN Mask            */

#define ADC_CFDCTL_DISCHEN_Pos          (1)                                         /*!< ADC_T::CFDCTL: DISCHEN Position        */
#define ADC_CFDCTL_DISCHEN_Msk          (0x1ul << ADC_CFDCTL_DISCHEN_Pos)           /*!< ADC_T::CFDCTL: DISCHEN Mask            */

#define ADC_CFDCTL_FDETCHEN_Pos         (8)                                         /*!< ADC_T::CFDCTL: FDETCHEN Position       */
#define ADC_CFDCTL_FDETCHEN_Msk         (0x1ul << ADC_CFDCTL_FDETCHEN_Pos)          /*!< ADC_T::CFDCTL: FDETCHEN Mask           */

#define ADC_ADPDMA_CURDAT_Pos           (0)                                         /*!< ADC_T::ADPDMA: CURDAT Position         */
#define ADC_ADPDMA_CURDAT_Msk           (0x3fffful << ADC_ADPDMA_CURDAT_Pos)        /*!< ADC_T::ADPDMA: CURDAT Mask             */

#define ADC_ADCALR_CALEN_Pos            (0)                                         /*!< ADC_T::ADCALR: CALEN Position          */
#define ADC_ADCALR_CALEN_Msk            (0x1ul << ADC_ADCALR_CALEN_Pos)             /*!< ADC_T::ADCALR: CALEN Mask              */

#define ADC_ADCALR_CALIE_Pos            (1)                                         /*!< ADC_T::ADCALR: CALIE Position          */
#define ADC_ADCALR_CALIE_Msk            (0x1ul << ADC_ADCALR_CALIE_Pos)             /*!< ADC_T::ADCALR: CALIE Mask              */

#define ADC_ADCALSTSR_CALIF_Pos         (0)                                         /*!< ADC_T::ADCALSTSR: CALIF Position       */
#define ADC_ADCALSTSR_CALIF_Msk         (0x1ul << ADC_ADCALSTSR_CALIF_Pos)          /*!< ADC_T::ADCALSTSR: CALIF Mask           */

/**@}*/ /* ADC_CONST */
/**@}*/ /* end of ADC register group */
/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __ADC_REG_H__ */
